// Pдесь будет логика рандомного размещения кораблей на поле
// Возвращает матрицу, где пустые ячейки = 0, корабли = уникальный id отдельного корабля
// В режиме разработки использую один захардкоженый вариант поля для обоих игроков.

export function renderField() {
    const field = [
        [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
        [1, 1, 1, 1, 0, 7, 0, 0, 0, 2],
        [0, 0, 0, 0, 0, 0, 0, 0, 0, 2],
        [0, 0, 8, 0, 4, 4, 0, 0, 0, 2],
        [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
        [0, 5, 0, 0, 0, 9, 0, 0, 0, 10],
        [0, 5, 0, 0, 0, 0, 0, 0, 0, 0],
        [0, 0, 0, 0, 3, 3, 3, 0, 6, 6],
        [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
        [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    ];

    return field;
};
